package task01.utils;

import java.util.Random;

public class ArraysOfNames {
    private static final Random random = new Random();
    private static final String[] maleNames = {"Ааво", "Абдельжелил", "Абдисанд", "Абдуласир", "Абдуло", "Абдуракиб",
            "Абзалдин", "Аблитар", "Абубакар", "Аваниш", "Авиэль", "Агакий", "Агитат", "Адельзян", "Адильсит",
            "Адыхам", "Азизахон", "Айано", "Айканаш", "Айцер", "Аклий", "Алаеддин", "Алеан", "Алескар", "Аликан",
            "Алипий", "Аллакулы", "Алфат", "Альгерд", "Альфоний", "Амашах", "Амиркан", "Анадрий", "Анвяр",
            "Анемподист", "Анндроник", "Антось", "Апляхад", "Аран", "Аревят", "Аристакес", "Арнак", "Арташек",
            "Арчил", "Асен", "Асраретдин", "Аталай", "Атул", "Афлатул", "Ахмадшох", "Ацамаз", "Аюбур", "Балтабай",
            "Бидзин", "Бронислав", "Вайн", "Ванелий", "Вегафард", "Видадий", "Вилоят", "Владелин", "Волген",
            "Габарахман", "Галихайдар", "Геворк", "Георгис", "Гилав", "Грант", "Давлаткадам", "Даулеткалий",
            "Джабрайл", "Джони", "Довлетяр", "Евстаф", "Ерванд", "Запрян", "Зилэ", "Изий", "Инвинарий", "Искейдер",
            "Кариб", "Клемент", "Куприй", "Лефтерий", "Магомедали", "Манвел", "Махамет", "Мингалий", "Муроджон", "Наушаб",
            "Оваким", "Оноре", "Панкратий", "Порсор", "Рамин", "Ренадий", "Ромаз", "Саидмомед", "Саулем", "Сеитхалиль",
            "Сильвёрст", "Суфиян", "Таштан", "Тронг", "Фадлы", "Фелий", "Фёдор", "Хенрик", "Эдмундо", "Эмерих", "Юлиаш",
            "Яшар", "Абрагь", "Авфи", "Адзам", "Айгиз", "Акланыш", "Алдан", "Алмерик", "Альфар", "Ангелис", "Анфос", "Арес",
            "Артек", "Атам", "Афы", "Бабич", "Байтиряк", "Бард", "Бастин", "Баят", "Белозёр", "Берсень", "Билал",
            "Бободжон", "Боримир", "Бригдо", "Бузтуган", "Бутырь", "Ваил", "Варданий", "Ватандар", "Венс", "Вилеор",
            "Витий", "Волф", "Вэйгон", "Гайб", "Гардан", "Гельды", "Гикор", "Гнуни", "Гостил", "Гукас", "Давинс",
            "Данжело", "Даулетияр", "Демпс", "Джалали", "Джероми", "Джохангир", "Диксон", "Добр", "Дольник", "Драммонд",
            "Дэв", "Евсеон", "Еливтерий", "Ерзат", "Ефив", "Жасур", "Завир", "Зартдин", "Зигманд", "Зулфи", "Игез", "Иклим",
            "Ильтимер", "Иосия", "Исса", "Йасир", "Кабул", "Калиньник", "Капшай", "Касиб", "Кейрон", "Кил", "Клемер", "Колумб",
            "Корриган", "Кристован", "Кузи", "Кутюк", "Кятиб", "Ледгер", "Лёв", "Лоллий", "Лэнгдон", "Магас", "Макей",
            "Мандель", "Марсиал", "Маухуб", "Мелтон", "Мечка", "Минас", "Мифтах", "Монти", "Мужавир", "Мурило", "Мухандис",
            "Мяча", "Наоранаил", "Недрун", "Никелас", "Нордин", "Овадья", "Олдос", "Ончифер", "Отгон", "Панайот", "Патвакан",
            "Пертак", "Пиулий", "Посник", "Пулат", "Ражих", "Ратман", "Рейд", "Риси", "Романий", "Рунако", "Сабиз", "Саир",
            "Самм", "Саркарда", "Саясат", "Секутор", "Сибгать", "Сисиний", "Сонан", "Стедмэн", "Сулла", "Сэйри", "Тайс",
            "Таркан", "Телау", "Тимбер", "Томассо", "Труфон", "Турстрон", "Угост", "Умдат", "Урыс", "Фадя", "Фарик",
            "Фемилий", "Фикран", "Флориан", "Фунун", "Хакими", "Харлантей", "Хибат", "Хончи", "Худайкули", "Цавар",
            "Чак", "Чиди", "Чэйз", "Шамхал", "Шевяк", "Шоунелл", "Эверли", "Элигий", "Энтонси", "Эшбел", "Юстасио"};

    private static final String[] femaleNames = {"Аалия", "Аворика", "Агилна", "Агриппина", "Адельфина", "Адрианна",
            "Азиля", "Айле", "Акима", "Алгурь", "Алжбета", "Алифа", "Алтея", "Альдона", "Амалиа", "Анав", "Ангесса",
            "Анета", "Анишора", "Антонель", "Анэле", "Арасия", "Арияда", "Ару", "Асмильда", "Атсуко", "Афросинья",
            "Багдана", "Бернадетта", "Бригита", "Валетина", "Веалетта", "Веслана", "Виоза", "Габриелла", "Галянка",
            "Гедалья", "Геннадия", "Гертрула", "Горгина", "цветок", "Густава", "Далия", "Дарвина", "Деляра", "Джанка",
            "Дзерасса", "Дионизия", "Драженка", "Евепина", "Евфримия", "Елилия", "Епистима", "Ефросимия", "Жельвира",
            "Завра", "Зелма", "Златовласка", "Зусана", "Идея", "Илона", "Иннеса", "Ириатна", "Кайра", "Касияна", "Килиона",
            "Комунина", "Кысти", "Ларика", "Ленадия", "Ливелина", "Лимера", "Лоралесса", "Людвига", "Магдалеена", "Манефа",
            "Мариола", "Мартцыза", "Мессуа", "Минна", "Муи", "Налатия", "Нелидия", "Нино", "Няргуль", "Ольгина", "Пайнусат",
            "Пасихат", "Петрунья", "Пульфера", "Райсат", "Рафиня", "Риакарда", "Розантина", "Ружина", "Садет", "Саоко",
            "Сейрана", "Синижат", "Социалла", "Сурая", "Тарана", "Туйаара", "Умгонат", "Фагия", "Фекла", "Фервония",
            "Флорианна", "Хаджарбиби", "Хивонька", "Эда", "Элионора", "Эльмара", "Энниль", "Юлдуза", "Ядвисия", "Абайоми",
            "Агапе", "Азаран", "Айн", "Акрам", "Алисон", "Аманд", "Ангрбода", "Аппак", "Арселиус", "Атур", "Аяра", "Банно",
            "Бая", "Бертти", "Блум", "Бриллианина", "Ваджиба", "Вардуи", "Венуста", "Вилгельмина", "Волямира", "Гамалия",
            "Гетулла", "Гонюл", "Гулбутта", "Гульболсын", "Гюрай", "Дариелла", "Декрета", "Джамиле", "Джилва", "Джосслин",
            "Диавонне", "Диомеда", "Дорит", "Дэй", "Елисава", "Жамила", "Жумабика", "Заряница", "Зимава", "Зуляля", "Изотерма",
            "Инджа", "Ирурия", "Йемима", "Кале", "Каприса", "Кастанелла", "Кейшия", "Кимия", "Клэнси", "Коропа", "Ксантиппа",
            "Кэйзи", "Лайан", "Лашиа", "Лигея", "Лолы", "Лэнгли", "Магшийа", "Малайка", "Марви", "Мармар", "Маухида",
            "Меженда", "Мзетвала", "Мир", "Моната", "Мукима", "Мэдисон", "Надрат", "Насифа", "Незнана", "Никхат",
            "Нурзат", "Одилия", "Оринька", "Паолабелла", "Перли", "Поузи", "Равен", "Рана", "Ренея", "Розабела", "Руммана",
            "Сага", "Самара", "Сафие", "Селести", "Силварт", "Скотти", "Среброзара", "Сурайя", "Таждида", "Тангул", "Тахиййа",
            "Тимербика", "Треника", "Уанита", "Урса", "Фарахат", "Фекола", "Филонилла", "Фрия", "Хайшат", "Хатфа", "Ходж",
            "Хуррия", "Цила", "Челси", "Шавон", "Шанта", "Шахназ", "Шиобан", "Шэндилин", "Элика", "Энергина", "Этта", "Юфима"};

    public static String getRandomMaleName() {
        return maleNames[random.nextInt(maleNames.length)];
    }

    public static String getRandomFemaleName() {
        return femaleNames[random.nextInt(femaleNames.length)];
    }
}
